2D_riblet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\\    /   O peration     | Website:  https://openfoam.org
\\  /    A nd           | Version:  7
\\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../parameters.dat"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

  upperWall
  {

    //velocity changed to x-direction
    type fixedValue;
    value uniform ($u_max 0 0);
  }

  lowerWall
  {
    type            noSlip;
  }



  leftWall
  {
    type zeroGradient;
  }


  rightWall
  {
    //rightWall is now the outlet
    type inletOutlet;
    inletValue uniform (0 0 0);
    value uniform (0 0 0);

    //type zeroGradient;
  }


  // frontWall
  // {
  //   type zeroGradient;
  // }
  //
  // backWall
  // {
  //   //this is no longer the outlet in the perpendicular flow.
  //   type zeroGradient;
  //   // type inletOutlet;
  //   // inletValue uniform (0 0 0);
  //   // value uniform (0 0 0);
  // }


  defaultFaces
  {
    type            empty;
  }
}


// ************************************************************************* //
