2D_riblet/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../parameters.dat"
dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }

    rightWall
    {
      //this is now the outlet for the perpendicular flow system
        type            fixedValue;
        value           uniform 0;
        //type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }

    // frontWall
    // {
    //     type            zeroGradient;
    // }
    //
    // backWall
    // {
    //   //this is no longer the outlet for the perpendicular flow
    //   type zeroGradient;
    //   // type            fixedValue;
    //   // value           uniform 0;
    // }



    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
